Revit 2026 API

# ConnectorAllRefs Property

---

All references of the connector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ConnectorSet AllRefs { get; }
```
```vb
Public ReadOnly Property AllRefs As ConnectorSet
	Get
```
```cpp
public:
property ConnectorSet^ AllRefs {
	ConnectorSet^ get ();
}
```
```fsharp
member AllRefs : ConnectorSet with get
```

#### Property Value

ConnectorSet

A set of connectors that the connectors is connected to, including both physical connection and logical connection.

#### Reference

Connector Class

Autodesk.Revit.DB Namespace